# Student Data
This notebook analyzes pass/fail data for a class

In [108]:
import numpy as np

data = [50,50,47,97,49,3]
grades = np.array(data)
study_hours = [10.0, 11.5, 9.0, 16.0, 9.25, 1.0]
student_data = np.array([study_hours, grades])
student_data[0][0]

10.0

In [109]:
import pandas as pd

df_students = pd.DataFrame({'Name': ['Dan', 'Joann', 'Pedro','Rosie', 'Ethan', 'Vicky'], 
                            'StudyHours': student_data[0],
                            'Grade': student_data[1]})

df_students

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0
5  Vicky        1.00    3.0

In [110]:
df_students.loc[0]

Name           Dan
StudyHours    10.0
Grade         50.0
Name: 0, dtype: object

In [111]:
df_students.loc[5, 'Grade']

3.0

In [112]:
df_students[df_students['Name'] == 'Vicky']

    Name  StudyHours  Grade
5  Vicky         1.0    3.0

In [113]:
df_students.query('Name=="Vicky"')

    Name  StudyHours  Grade
5  Vicky         1.0    3.0

In [114]:
df_students[df_students.Name=="Vicky"]

    Name  StudyHours  Grade
5  Vicky         1.0    3.0

In [115]:
df_Test = pd.read_csv('Test_data.csv', delimiter=',', header='infer')

In [116]:
df_Test.isnull()

     Name    Age   Score
0   False  False   False
1   False  False   False
2   False  False   False
3   False  False   False
4   False  False   False
5   False  False   False
6   False  False   False
7   False  False   False
8   False  False   False
9   False  False   False
10  False  False   False
11  False  False   False
12  False  False   False
13  False  False   False
14  False  False   False
15  False  False   False
16  False  False   False
17  False  False   False
18  False  False   False
19  False  False   False
20  False  False   False
21  False  False   False
22  False  False   False
23  False  False   False
24  False  False   False
25  False  False   False

In [117]:
df_Test.isnull().sum()

Name      0
 Age      0
 Score    0
dtype: int64